app/controllers/admin/homes_controller.rb

  def top
    @order = Order.page(params[:page]).per(10)
---
SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]