app/controllers/admin/items_controller.rb

  def index
    @item = Item.page(params[:page]).per(10)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def new
    @item = Item.new
    @genre = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @item = Item.new(item_params)
    @item.save!
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "non_taxed_price", "sales_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)