app/views/admin/orders/show.html.erb

              <%= form_with model: detail, url: admin_order_path, local:true do |f| %>
                <%= f.select :making_status, OrderDetail.making_statuses_i18n.invert %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 6]]