app/views/admin/homes/top.html.erb

              <% @sum = 0 %>
              <% order.order_details.each do |detail| %>
---
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 1]]