app/controllers/public/addresses_controller.rb

SELECT  "addresses".* FROM "addresses" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @address = Address.new
    @addresses = Address.page(params[:page]).per(10)

INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 3], ["name", "令和道子"], ["postal_code", "1111111"], ["address", "tokyo"], ["created_at", "2022-04-10 02:08:30.856811"], ["updated_at", "2022-04-10 02:08:30.856811"]]
---
  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    @address.save