app/controllers/public/cart_items_controller.rb

  def create
    @cart_item = CartItem.new(cart_item_params)
    @cart_item.save
---
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 1], ["created_at", "2022-03-31 07:30:53.509953"], ["updated_at", "2022-03-31 07:30:53.509953"]]

  def update
    @cart_items = CartItem.find(params[:id])
    @cart_items.update(cart_item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 2], ["updated_at", "2022-04-10 02:13:14.026189"], ["id", 16]]

  def destroy_all
    @cart_items = CartItem.all
    @cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items"
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 16]]