app/controllers/public/homes_controller.rb

  def top
    @item = Item.page(params[:page]).per(4)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"