app/controllers/public/items_controller.rb

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 8], ["OFFSET", 0]]
---
  def index
    @item = Item.page(params[:page]).per(8)