app/controllers/public/orders_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
  def confirm
    #binding.pry
    @cart_items = CartItem.all

INSERT INTO "orders" ("customer_id", "post_code", "address", "name", "total_payment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 5], ["item_id", 1], ["price", 1000], ["amount", 2], ["created_at", "2022-04-03 05:30:09.033410"], ["updated_at", "2022-04-03 05:30:09.033410"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 8]]
---
  def create
    @order = Order.new(order_params)
    @order.save
    current_customer.cart_items.each do | cart_item |
      order_detail = OrderDetail.new
      order_detail.order_id = @order.id
      order_detail.item_id = cart_item.item_id
      order_detail.item.name = cart_item.item.name
      order_detail.price = cart_item.item.non_taxed_price
      order_detail.amount = cart_item.amount
      order_detail.making_status = "cant"
      order_detail.save
    end
    current_customer.cart_items.destroy_all

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order_detail = OrderDetail.find(params[:id])